{
  "model_id": "anything_to_satisfy_the_parser",
  "vocabulary": [
    "<s>",
    "<pad>",
    "</s>",
    "<unk>",
    "、",
    "▁نسبت",
    "。",
    "▁ھن",
    "▁ھو",
    "「",
    "」",
    "فض",
    "▁سار",
    "▁پہنچے",
    "’",
    "▁Nakon",
    "nova",
    "jena",
    "!",
    "▁حديث",
    "工業",
    "'",
    "(",
    "▁soba",
    ")",
    "▁شوق",
    "في",
    "▁pod",
    "株",
    ",",
    ".",
    "قر",
    "進",
    "3",
    "8",
    "▁پر",
    "▁pot",
    ":",
    "▁مختار",
    "格",
    "▁pos",
    "▁مزاج",
    "قل",
    "قم",
    "⁄",
    "فسر",
    "ću",
    "く",
    "▁bila",
    "あげ",
    "▁طرح",
    "し",
    "▁vrhunski",
    "▁شعار",
    "▁jednu",
    "▁والی",
    "▁والے",
    "▁ہر",
    "た",
    "a",
    "▁ٿي",
    "▁طبیعت",
    "b",
    "▁ڪري",
    "▁حدیث",
    "e",
    "▁ہو",
    "g",
    "h",
    "▁ہم",
    "k",
    "に",
    "l",
    "ština",
    "m",
    "▁نبی",
    "n",
    "の",
    "▁لکڻ",
    "s",
    "t",
    "▁سان",
    "▁سبب",
    "▁میں",
    "▁lit",
    "へ",
    "べ",
    "لف",
    "لق",
    "لم",
    "や",
    "ثير",
    "مت",
    "لي",
    "▁pri",
    "▁راست",
    "り",
    "▁عطا",
    "▁66",
    "خدا",
    "を",
    "▁kuća",
    "▁ڪرڻ",
    "▁تھا",
    "増",
    "▁پکار",
    "▁طا",
    "▁طب",
    "مل",
    "▁راز",
    "▁prenosi",
    "نا",
    "▁سہ",
    "▁طرف",
    "▁بلند",
    "英文",
    "vne",
    "▁،",
    "▁سی",
    "ائين",
    "▁زمين",
    "▁zbog",
    "点",
    "▁stoljeća",
    "jeti",
    "▁ا",
    "▁ب",
    "ني",
    "▁امير",
    "▁آ",
    "▁آئے",
    "▁خ",
    "vod",
    "▁سے",
    "▁ت",
    "▁ج",
    "▁ص",
    "▁ض",
    "▁ط",
    "čenja",
    "buku",
    "▁ظ",
    "▁90",
    "▁ر",
    "vom",
    "▁ز",
    "▁1990",
    "▁ش",
    "vor",
    "ena",
    "ologi",
    "▁yn",
    "الت",
    "یا",
    "▁ع",
    "ene",
    "الا",
    "یت",
    "وا",
    "▁م",
    "یح",
    "▁ن",
    "▁و",
    "ید",
    "▁صدق",
    "▁عن",
    "▁za",
    "▁ف",
    "▁ق",
    "یر",
    "▁ل",
    "者が",
    "ور",
    "▁عبداللہ",
    "▁obra",
    "وع",
    "الف",
    "نٹ",
    "ô",
    "▁رسول",
    "یل",
    "▁کوئی",
    "ین",
    "▁zi",
    "uncu",
    "▁ٻي",
    "لہ",
    "▁انجام",
    "▁fan",
    "▁پنهنجو",
    "▁اهو",
    "▁vrh",
    "بار",
    "▁کیا",
    "ć",
    "▁مستقیم",
    "لی",
    "▁اور",
    "▁اهي",
    "لے",
    "باط",
    "▁پڑھ",
    "▁اوهان",
    "احمد",
    "isto",
    "▁ہاتھوں",
    "▁پنھنجي",
    "يء",
    "▁lân",
    "▁پ",
    "مہ",
    "يت",
    "▁بال",
    "يد",
    "▁خرچ",
    "ير",
    "▁جذب",
    "▁لا",
    "نگ",
    "وار",
    "▁ڏ",
    "▁شاہد",
    "بان",
    "▁قرار",
    "vanja",
    "يف",
    "▁خلاف",
    "▁بغداد",
    "نہ",
    "اني",
    "ين",
    "يه",
    "社",
    "▁njihova",
    "▁مج",
    "▁بازار",
    "نے",
    "▁ک",
    "▁ڪ",
    "▁تشریف",
    "▁مؤ",
    "▁ملي",
    "ایت",
    "▁مع",
    "▁ملا",
    "▁ہ",
    "▁plod",
    "یں",
    "▁نب",
    "▁ملت",
    "▁ی",
    "▁من",
    "▁حیثیت",
    "▁ali",
    "660",
    "وں",
    "đe",
    "یہ",
    "▁لپ",
    "đi",
    "▁خطا",
    "وی",
    "▁پڇ",
    "▁ایک",
    "▁نام",
    "šnje",
    "▁پٽ",
    "▁سلطنت",
    "▁۱",
    "▁کثیر",
    "から",
    "▁۽",
    "▁dvije",
    "▁breed",
    "▁۾",
    "▁200",
    "▁Ana",
    "▁مسلمانوں",
    "oče",
    "▁ukupno",
    "▁حاصل",
    "▁ترجیح",
    "▁پڻ",
    "ama",
    "انہ",
    "tru",
    "انی",
    "▁dokaz",
    "▁آنکھیں",
    "▁لکي",
    "َّ",
    "سلام",
    "始",
    "▁عرب",
    "▁جهڙو",
    "cre",
    "▁لاء",
    "نام",
    "▁224",
    "▁عورت",
    "ُّ",
    "▁نبي",
    "▁kada",
    "▁حضرت",
    "▁تعالی",
    "▁عدل",
    "▁metara",
    "▁چئي",
    "▁moguće",
    "▁مدینہ",
    "plo",
    "میر",
    "▁عبادت",
    "صاف",
    "▁شهر",
    "▁والد",
    "▁اسلام",
    "出",
    "▁آمدن",
    "موا",
    "世界",
    "▁ہے",
    "▁نے",
    "ِّ",
    "▁godina",
    "▁هڪ",
    "nih",
    "▁ostvari",
    "ضرار",
    "jal",
    "▁razm",
    "▁prostor",
    "▁گئے",
    "させる",
    "▁لباس",
    "▁دعوت",
    "▁زمرہ",
    "tvr",
    "▁اصحاب",
    "▁(2)",
    "▁وہ",
    "▁قسم",
    "▁یہ",
    "▁deset",
    "▁عمر",
    "▁المسلمين",
    "سار",
    "▁شروع",
    "▁دولت",
    "▁سعد",
    "đeni",
    "▁تور",
    "▁عباس",
    "▁خواب",
    "▁شریف",
    "ودي",
    "ڑی",
    "▁عمو",
    "stavlja",
    "的な",
    "ary",
    "▁وقت",
    "海外",
    "▁پاڻ",
    "▁حجر",
    "▁uko",
    "▁فرماتے",
    "▁pomaže",
    "▁عالم",
    "▁علم",
    "▁گا۔",
    "▁رضي",
    "▁لانے",
    "tili",
    "▁عهد",
    "▁مخلوق",
    "▁ہے۔",
    "企業",
    "ندا",
    "rum",
    "▁ڏانهن",
    "▁بنا",
    "▁بند",
    "▁ہزار",
    "▁ispod",
    "▁نالو",
    "وري",
    "▁نالي",
    "▁خوبی",
    "▁sklad",
    "▁konačno",
    "▁اپنے",
    "▁لگ",
    "▁ود",
    "▁ور",
    "▁هي",
    "▁خاندان",
    "▁generacij",
    "lji",
    "▁ثروت",
    "▁هن",
    "▁وا",
    "▁هو",
    "▁معرفت",
    "حضور",
    "قار",
    "قاب",
    "▁قرآن",
    "▁عنه",
    "▁%",
    "▁druge",
    "▁'",
    "▁(",
    "▁-",
    "▁پہنچ",
    "građ",
    "▁materijal",
    "nom",
    "ڙو",
    "▁6",
    "▁چھوڑ",
    "▁يا",
    "▁1",
    "▁هٿ",
    "動",
    "▁4",
    "قام",
    "1959",
    "šne",
    "▁:",
    "▁پہلے",
    "▁یقین",
    "拠",
    "▁H",
    "▁خالی",
    "▁مرتبہ",
    "▁گذر",
    "▁آھي",
    "▁اظہار",
    "▁مذهبي",
    "▁U",
    "▁građevin",
    "▁نہ",
    "▁وچ",
    "太平洋",
    "▁صفت",
    "▁فرما",
    "▁tijekom",
    "▁بعض",
    "▁a",
    "‘‘",
    "▁سوره",
    "▁برکت",
    "▁o",
    "▁p",
    "▁i",
    "▁l",
    "▁u",
    "▁رسالت",
    "jit",
    "▁veličine",
    "▁s",
    "▁انتقال",
    "化学",
    "ša",
    "▁صرف",
    "خلي",
    "▁آغاز",
    "▁سخت",
    "▁onda",
    "1987",
    "▁بلکہ",
    "ječ",
    "▁puno",
    "▁traje",
    "▁بعد",
    "خلق",
    "▁کریم",
    "iranju",
    "▁Ta",
    "▁عہد",
    "log",
    "▁ispred",
    "▁ceremoni",
    "▁خوا",
    "▁liker",
    "azi",
    "▁شمار",
    "▁سلام",
    "pane",
    "▁što",
    "▁علاوه",
    "▁کرنے",
    "▁راہ",
    "▁ہاتھ",
    "آخر",
    "▁تھے",
    "▁dat",
    "ستان",
    "عادت",
    "ješ",
    "▁šum",
    "▁kruh",
    "▁تمہاری",
    "▁ہدایت",
    "▁احمد",
    "▁ڏينهن",
    "▁شریعت",
    "▁لکھتے",
    "▁ٿيا",
    "dono",
    "icama",
    "رحم",
    "▁لیکن",
    "▁wie",
    "▁کرنا",
    "化粧品",
    "جنب",
    "▁ہوگئے",
    "▁علاوہ",
    "▁پات",
    "▁ہیں",
    "▁dei",
    "▁پاس",
    "▁حال",
    "▁سندس",
    "▁بھی",
    "▁stab",
    "▁klim",
    "▁ٿيو",
    "▁محبت",
    "▁12.",
    "▁ولادت",
    "▁zraka",
    "以降",
    "▁المو",
    "▁چيو",
    "▁sti",
    "den",
    "名",
    "▁عمرو",
    "▁سید",
    "▁سیر",
    "bina",
    "▁nešto",
    "▁غربت",
    "▁ž",
    "▁Zi",
    "▁امام",
    "▁قلب",
    "▁الله",
    "▁قلت",
    "▁رہے",
    "▁13.",
    "▁المج",
    "▁گھر",
    "▁شام",
    "▁مکہ",
    "عفو",
    "▁kraja",
    "▁preciz",
    "▁دفع",
    "▁آهن",
    "▁مضمون",
    "▁بڑی",
    "▁stol",
    "▁پٿر",
    "▁انور",
    "▁čet",
    "▁هجڻ",
    "وفا",
    "▁svojih",
    "▁یعنی",
    "▁میرے",
    "▁کرم",
    "seo",
    "▁خدمت",
    "ce",
    "▁جڏهن",
    "ch",
    "▁متو",
    "ACI",
    "つく",
    "▁بجائے",
    "▁مطابق",
    "رسل",
    "REP",
    "▁انهن",
    "株式会社",
    "▁لیے",
    "▁خلافت",
    "ruše",
    "wol",
    "▁جيڪو",
    "▁انہوں",
    "کر",
    "en",
    "ڪاري",
    "▁مختلف",
    "▁لوگ",
    "et",
    "▁ڏيندو",
    "ولت",
    "▁انہیں",
    "کل",
    "▁metodo",
    "▁منزل",
    "▁حفظ",
    "يون",
    "ولو",
    "2002",
    "▁اللہ",
    "ڪن",
    "حدث",
    "▁وسلم",
    "اب",
    "▁svojem",
    "▁مسجد",
    "ئي",
    "▁znanja",
    "اد",
    "▁پیدا",
    "اس",
    "عون",
    "▁stik",
    "ومن",
    "▁’’",
    "▁št",
    "▁زمان",
    "he",
    "▁قبائل",
    "ال",
    "با",
    "ان",
    "▁عادت",
    "▁هئا",
    "▁بيت",
    "▁lokal",
    "▁be",
    "▁Kiva",
    "▁واپسی",
    "▁dok",
    "▁zemlju",
    "▁کار",
    "ؤں",
    "▁سختی",
    "▁طیب",
    "▁slo",
    "بل",
    "نہیں",
    "بن",
    "▁آس",
    "当初",
    "▁گرو",
    "im",
    "▁بین",
    "▁آن",
    "▁آم",
    "▁dos",
    "▁ci",
    "▁akumul",
    "▁oblika",
    "zimi",
    "▁محمود",
    "改",
    "zima",
    "je",
    "ji",
    "▁do",
    "▁ابن",
    "▁ويو",
    "کی",
    "▁سفر",
    "تز",
    "▁دیتی",
    "▁بزرگ",
    "کار",
    "ju",
    "▁اطمینان",
    "▁de",
    "▁آپ",
    "tari",
    "▁کا",
    "لفت",
    "ka",
    "گا",
    "▁dy",
    "ائي",
    "ته",
    "▁ٿيون",
    "▁کان",
    "▁کش",
    "には",
    "صلى",
    "▁کر",
    "▁en",
    "ثر",
    "▁بنی",
    "▁کد",
    "▁فرمایا",
    "اؤں",
    "成長",
    "ئے",
    "▁لقب",
    "▁ڳالھ",
    "会社",
    "▁هئي",
    "▁fur",
    "اں",
    "la",
    "le",
    "uru",
    "جا",
    "li",
    "▁صلى",
    "ثي",
    "▁",
    "lo",
    "▁nije",
    "جر",
    "▁تعبير",
    "جز",
    "▁اگر",
    "ا۔",
    "▁دریافت",
    "創業",
    "▁کئے",
    "ma",
    "▁Kao",
    "▁Men",
    "▁konstrukcij",
    "AMO",
    "بی",
    "mu",
    "▁ممتاز",
    "▁سڄو",
    "kron",
    "ne",
    "▁سياست",
    "حن",
    "خا",
    "▁men",
    "krov",
    "▁سڄي",
    "▁رهيا",
    "▁mei",
    "▁سالم",
    "▁سالن",
    "no",
    "▁عليه",
    "▁بیان",
    "▁گمراہ",
    "▁سرفراز",
    "▁مال",
    "▁ٻنهي",
    "nu",
    "▁مان",
    "▁رفع",
    "▁هجر",
    "▁اختلاف",
    "of",
    "حافظ",
    "▁سنا",
    "▁جہاد",
    "▁društva",
    "ائی",
    "نون",
    "om",
    "▁osjeća",
    "▁وڏو",
    "irano",
    "ئين",
    "▁زيارت",
    "irana",
    "مار",
    "دو",
    "▁طريق",
    "▁ar",
    "▁poput",
    "▁کے",
    "▁کی",
    "▁jo",
    "،",
    "▁gli",
    "▁کرتے",
    "▁koje",
    "▁تم",
    "▁تو",
    "▁ki",
    "▁ته",
    "ؓ",
    "▁گا",
    "lā",
    "جہ",
    "را",
    "iš",
    "▁دیکھ",
    "رج",
    "مام",
    "رح",
    "رخ",
    "▁تع",
    "▁vje",
    "آ",
    "▁između",
    "دھی",
    "ا",
    "ب",
    "ت",
    "▁تي",
    "ج",
    "▁koja",
    "ح",
    "▁اک",
    "▁جان",
    "د",
    "▁فرم",
    "ذ",
    "▁جب",
    "ر",
    "▁جا",
    "▁pojedin",
    "ز",
    "olo",
    "س",
    "▁گه",
    "ش",
    "▁حضور",
    "ض",
    "▁گو",
    "▁Verde",
    "▁غالب",
    "ري",
    "ع",
    "▁گم",
    "ڪنھن",
    "▁گل",
    "لوب",
    "▁يزيد",
    "▁فري",
    "ndro",
    "▁خدا",
    "▁اے",
    "ف",
    "ق",
    "ru",
    "▁nepo",
    "ل",
    "م",
    "ن",
    "ه",
    "▁dizajn",
    "و",
    "ي",
    "▁جر",
    "ٌ",
    "▁جائے",
    "ٍ",
    "long",
    "َ",
    "ُ",
    "▁جو",
    "ِ",
    "ّ",
    "se",
    "▁جي",
    "ْ",
    "▁جن",
    "ٖ",
    "▁بہ",
    "sk",
    "▁Tim",
    "▁غیر",
    "▁lang",
    "▁kamen",
    "▁my",
    "▁ہوجائیں",
    "ارا",
    "▁حس",
    "▁بخاری",
    "▁ہیں۔",
    "▁قابل",
    "ٰ",
    "te",
    "دہ",
    "سن",
    "年",
    "ادي",
    "▁na",
    "stan",
    "ٹ",
    "ٺ",
    "▁حق",
    "پ",
    "▁الآ",
    "دے",
    "▁fo",
    "▁struktur",
    "ڇ",
    "▁کو",
    "▁الا",
    "▁ممنوع",
    "ڍ",
    "شق",
    "▁کي",
    "▁ڪن",
    "▁بھیج",
    "▁تمہیں",
    "dali",
    "عطاء",
    "▁Gra",
    "صح",
    "un",
    "ڙ",
    "▁gr",
    "▁اس",
    "▁از",
    "▁ار",
    "قول",
    "ک",
    "▁اح",
    "ve",
    "▁اب",
    "▁ٻيهر",
    "▁ام",
    "▁vodo",
    "▁ال",
    "▁فضا",
    "▁مذکور",
    "▁klimat",
    "▁تقوی",
    "ڻ",
    "ھ",
    "▁ڪيائين",
    "ہ",
    "رے",
    "▁hladno",
    "ۃ",
    "▁بد",
    "▁بہتر",
    "▁بر",
    "روا",
    "ی",
    "روج",
    "▁با",
    "▁ان",
    "▁بات",
    "▁او",
    "▁بن",
    "ے",
    "ûn",
    "۔",
    "▁بار",
    "▁باس",
    "dane",
    "▁الق",
    "▁najpoznatij",
    "▁الل",
    "▁الم",
    "▁Vrh",
    "▁is",
    "oblikovan",
    "▁in",
    "▁الطب",
    "ڻي",
    "▁je",
    "ادی",
    "▁کہ",
    "へと",
    "▁صفات",
    "▁غنی",
    "▁nekoliko",
    "▁کڻ",
    "▁معاف",
    "سے",
    "変更",
    "▁sa",
    "▁سرانجام",
    "▁فتح",
    "月",
    "▁vremena",
    "عب",
    "▁کڻي",
    "عت",
    "▁سر",
    "▁دور",
    "▁ست",
    "عر",
    "▁اسی",
    "▁سب",
    "▁se",
    "▁protek",
    "本",
    "▁su",
    "jedi",
    "▁40",
    "ھر",
    "国際",
    "▁سو",
    "▁te",
    "▁ساتھ",
    "▁tink",
    "ھل",
    "oksen",
    "غو",
    "▁ڏنو",
    "ں۔",
    "▁شن",
    "علامه",
    "▁ži",
    "▁va",
    "حمد",
    "ija",
    "▁محمد",
    "▁سڀ",
    "حضرت",
    "ije",
    "▁دون",
    "▁ڏنا",
    "▁دکھا",
    "▁koe",
    "▁حلق",
    "▁سڏ",
    "▁مشرف",
    "ٹے",
    "▁خواہش",
    "kom",
    "▁ili",
    "▁تک",
    "▁ima",
    "رائي",
    "صحاب",
    "▁of",
    "▁تہ",
    "▁ob",
    "▁نہیں",
    "▁od",
    "▁خل",
    "▁جنهن",
    "▁Mesa",
    "▁gradi",
    "▁قائم",
    "▁رکھا",
    "▁دين",
    "اعات",
    "▁آواز",
    "izaci",
    "▁اٹھا",
    "▁دل",
    "ima",
    "▁danas",
    "▁گھ",
    "▁گهر",
    "▁broja",
    "▁رکھنے",
    "▁حکمت",
    "▁po",
    "▁قبول",
    "ٽڪ",
    "▁پيء",
    "▁مجتمع",
    "▁اعمال",
    "ine",
    "FIC",
    "▁احسان",
    "▁حین",
    "gje",
    "▁18",
    "▁ہوئی",
    "▁کہا",
    "▁قبیل",
    "▁ro",
    "▁دی۔",
    "▁civilizaci",
    "▁teori",
    "めた",
    "▁okrug",
    "▁današnji",
    "▁گذري",
    "▁ہوئے",
    "ega",
    "▁تمام"
  ],
  "scores": [
    0.0,
    0.0,
    0.0,
    0.0,
    -6.610896110534668,
    -11.903949737548828,
    -6.411019802093506,
    -13.111821174621582,
    -12.475632667541504,
    -8.94989013671875,
    -8.913808822631836,
    -12.612136840820312,
    -13.197681427001953,
    -14.200822830200195,
    -6.379403591156006,
    -12.10725212097168,
    -11.451247215270996,
    -12.569819450378418,
    -6.61658239364624,
    -12.716913223266602,
    -12.647109031677246,
    -6.345553398132324,
    -7.722129821777344,
    -13.328119277954102,
    -5.9974517822265625,
    -13.542387008666992,
    -11.525911331176758,
    -9.303495407104492,
    -13.15868091583252,
    -3.4635426998138428,
    -3.625642776489258,
    -12.082132339477539,
    -11.200728416442871,
    -8.533885955810547,
    -9.478791236877441,
    -8.830430030822754,
    -9.85542106628418,
    -5.629745960235596,
    -10000.0,
    -11.07493782043457,
    -10.675272941589355,
    -14.053406715393066,
    -12.350106239318848,
    -13.201828002929688,
    -15.362364768981934,
    -14.316963195800781,
    -11.72597599029541,
    -10.451481819152832,
    -10.200002670288086,
    -12.970951080322266,
    -10.799960136413574,
    -9.750066757202148,
    -14.09317684173584,
    -13.132211685180664,
    -12.164549827575684,
    -11.790772438049316,
    -11.185127258300781,
    -11.52169418334961,
    -10.283937454223633,
    -5.5477118492126465,
    -10.650121688842773,
    -13.610538482666016,
    -8.289443016052246,
    -10.517338752746582,
    -10000.0,
    -5.701941967010498,
    -10.288777351379395,
    -7.932966709136963,
    -7.701241970062256,
    -10.9612398147583,
    -7.4715776443481445,
    -8.438796997070312,
    -7.762022495269775,
    -13.653663635253906,
    -6.647110939025879,
    -13.096002578735352,
    -6.093497276306152,
    -7.835560321807861,
    -13.766554832458496,
    -5.072621822357178,
    -6.071900844573975,
    -10.290907859802246,
    -11.627830505371094,
    -8.404854774475098,
    -11.820650100708008,
    -11.6625394821167,
    -12.946660041809082,
    -11.946572303771973,
    -13.20298957824707,
    -12.11659049987793,
    -9.643321990966797,
    -12.949349403381348,
    -11.78995132446289,
    -10.989119529724121,
    -8.787092208862305,
    -12.648849487304688,
    -10.379737854003906,
    -13.063958168029785,
    -11.535991668701172,
    -13.839150428771973,
    -8.22523021697998,
    -13.274272918701172,
    -11.137674331665039,
    -10.805622100830078,
    -12.990604400634766,
    -14.285995483398438,
    -13.078483581542969,
    -12.852004051208496,
    -11.508638381958008,
    -12.764389991760254,
    -13.693453788757324,
    -9.525500297546387,
    -13.369109153747559,
    -10.901957511901855,
    -12.365242004394531,
    -12.302881240844727,
    -12.062744140625,
    -9.150372505187988,
    -10.726777076721191,
    -12.626052856445312,
    -12.744816780090332,
    -11.537252426147461,
    -10.271102905273438,
    -13.577858924865723,
    -12.193032264709473,
    -9.33310604095459,
    -9.089756965637207,
    -10.834887504577637,
    -13.551883697509766,
    -10.807448387145996,
    -12.546935081481934,
    -10.950186729431152,
    -11.474028587341309,
    -8.803434371948242,
    -9.171648025512695,
    -10.806365966796875,
    -10.984315872192383,
    -12.26717758178711,
    -11.871655464172363,
    -13.023716926574707,
    -13.473764419555664,
    -13.253439903259277,
    -10.311766624450684,
    -10.744394302368164,
    -12.47635269165039,
    -11.38111400604248,
    -11.568384170532227,
    -10000.0,
    -10.497817039489746,
    -10.765369415283203,
    -11.620940208435059,
    -8.651301383972168,
    -12.216012001037598,
    -11.396681785583496,
    -10.353537559509277,
    -9.594635963439941,
    -12.703508377075195,
    -10.891910552978516,
    -9.981459617614746,
    -9.07016372680664,
    -13.325227737426758,
    -9.9458646774292,
    -7.174049377441406,
    -10.452103614807129,
    -13.543808937072754,
    -10000.0,
    -7.37307596206665,
    -10000.0,
    -10.899341583251953,
    -11.181215286254883,
    -9.23928451538086,
    -13.12946605682373,
    -10.758359909057617,
    -14.190896987915039,
    -10.881155967712402,
    -11.799145698547363,
    -13.552739143371582,
    -12.35738754272461,
    -10.790441513061523,
    -11.642875671386719,
    -11.203944206237793,
    -11.164298057556152,
    -10.391376495361328,
    -10.602131843566895,
    -13.296408653259277,
    -12.801287651062012,
    -13.29976749420166,
    -11.127630233764648,
    -9.635873794555664,
    -13.025283813476562,
    -11.522773742675781,
    -12.629497528076172,
    -11.675955772399902,
    -10.100441932678223,
    -9.490818977355957,
    -12.654541015625,
    -11.304871559143066,
    -8.778549194335938,
    -12.341999053955078,
    -12.693137168884277,
    -12.534963607788086,
    -12.560155868530273,
    -12.807035446166992,
    -14.408479690551758,
    -10.91116714477539,
    -13.606574058532715,
    -13.693682670593262,
    -11.006491661071777,
    -13.511610984802246,
    -10.69263744354248,
    -10000.0,
    -10.88202953338623,
    -9.945484161376953,
    -11.082690238952637,
    -13.169434547424316,
    -10.761433601379395,
    -12.539514541625977,
    -9.714284896850586,
    -10.531815528869629,
    -11.411252975463867,
    -12.159621238708496,
    -13.439103126525879,
    -12.159096717834473,
    -10.569905281066895,
    -11.485320091247559,
    -11.685418128967285,
    -11.131010055541992,
    -13.32590389251709,
    -12.843395233154297,
    -11.425615310668945,
    -9.176533699035645,
    -10.86955738067627,
    -11.128808975219727,
    -13.251603126525879,
    -12.20699405670166,
    -11.551314353942871,
    -10.626527786254883,
    -11.38455581665039,
    -11.614538192749023,
    -14.187246322631836,
    -12.982544898986816,
    -11.797250747680664,
    -10000.0,
    -9.858101844787598,
    -12.285886764526367,
    -12.553010940551758,
    -13.370101928710938,
    -10.696676254272461,
    -12.74817180633545,
    -12.134454727172852,
    -11.036406517028809,
    -8.165318489074707,
    -13.548136711120605,
    -9.375162124633789,
    -13.292466163635254,
    -9.353793144226074,
    -11.82857894897461,
    -11.406195640563965,
    -13.611187934875488,
    -12.325207710266113,
    -13.719786643981934,
    -11.11467170715332,
    -13.631454467773438,
    -9.855673789978027,
    -10.353020668029785,
    -13.05349349975586,
    -13.028356552124023,
    -13.965872764587402,
    -12.046480178833008,
    -10000.0,
    -9.703826904296875,
    -9.335156440734863,
    -12.247420310974121,
    -13.311925888061523,
    -9.245621681213379,
    -9.983458518981934,
    -10.990195274353027,
    -12.795949935913086,
    -13.135777473449707,
    -13.378888130187988,
    -11.403210639953613,
    -13.6084566116333,
    -12.680025100708008,
    -10.440314292907715,
    -12.222440719604492,
    -11.42122745513916,
    -11.383726119995117,
    -12.9137601852417,
    -14.476696968078613,
    -13.467201232910156,
    -12.135478973388672,
    -12.71440601348877,
    -12.663864135742188,
    -11.900956153869629,
    -13.902737617492676,
    -11.216065406799316,
    -10.742656707763672,
    -10000.0,
    -13.595476150512695,
    -12.485321044921875,
    -13.868348121643066,
    -13.327157020568848,
    -11.195040702819824,
    -11.418901443481445,
    -12.40562915802002,
    -13.329121589660645,
    -13.79185962677002,
    -13.747245788574219,
    -12.834506034851074,
    -14.360300064086914,
    -11.659099578857422,
    -12.826003074645996,
    -13.300061225891113,
    -13.438057899475098,
    -10.775205612182617,
    -11.984052658081055,
    -11.038277626037598,
    -9.496801376342773,
    -13.454340934753418,
    -12.906173706054688,
    -10.528743743896484,
    -9.034796714782715,
    -9.208064079284668,
    -13.150303840637207,
    -11.386055946350098,
    -10.825066566467285,
    -9.702229499816895,
    -13.07643985748291,
    -13.973017692565918,
    -10.952235221862793,
    -13.427935600280762,
    -11.593998908996582,
    -11.631296157836914,
    -12.894272804260254,
    -12.372183799743652,
    -12.643047332763672,
    -13.63158893585205,
    -12.459877967834473,
    -14.055868148803711,
    -9.961138725280762,
    -10.343199729919434,
    -11.893840789794922,
    -10.064606666564941,
    -12.285531997680664,
    -11.363245010375977,
    -13.014981269836426,
    -12.707101821899414,
    -11.332316398620605,
    -11.302778244018555,
    -13.055937767028809,
    -13.674442291259766,
    -11.654837608337402,
    -12.616765975952148,
    -12.207862854003906,
    -11.831457138061523,
    -13.68111801147461,
    -12.976818084716797,
    -14.430807113647461,
    -12.421124458312988,
    -11.50658893585205,
    -11.110703468322754,
    -10.588051795959473,
    -11.868654251098633,
    -12.110957145690918,
    -13.921645164489746,
    -13.405242919921875,
    -13.995997428894043,
    -14.098799705505371,
    -12.004497528076172,
    -11.506338119506836,
    -12.163915634155273,
    -13.178263664245605,
    -14.001510620117188,
    -12.172317504882812,
    -13.293499946594238,
    -10000.0,
    -10000.0,
    -11.053098678588867,
    -11.700507164001465,
    -9.89022159576416,
    -13.137804985046387,
    -11.584470748901367,
    -11.47780704498291,
    -12.676255226135254,
    -13.47961711883545,
    -13.04322338104248,
    -12.198275566101074,
    -13.25001335144043,
    -12.475261688232422,
    -12.113178253173828,
    -13.952543258666992,
    -10.791595458984375,
    -12.600780487060547,
    -12.942652702331543,
    -11.553879737854004,
    -10.698843002319336,
    -12.703505516052246,
    -13.684463500976562,
    -12.352499961853027,
    -13.843332290649414,
    -10.838998794555664,
    -10.505772590637207,
    -9.910398483276367,
    -10000.0,
    -13.492959976196289,
    -12.739365577697754,
    -12.663825035095215,
    -11.77187728881836,
    -12.291872024536133,
    -9.96491813659668,
    -11.795421600341797,
    -8.20328426361084,
    -5.926211357116699,
    -6.1764984130859375,
    -12.557028770446777,
    -13.187960624694824,
    -13.275311470031738,
    -9.935545921325684,
    -12.842405319213867,
    -8.376090049743652,
    -12.797646522521973,
    -10.724736213684082,
    -7.551031589508057,
    -12.609972953796387,
    -10.906079292297363,
    -8.062232971191406,
    -12.41627025604248,
    -14.217342376708984,
    -13.32412338256836,
    -7.829031944274902,
    -11.670573234558105,
    -13.152725219726562,
    -13.748356819152832,
    -8.923832893371582,
    -13.297384262084961,
    -13.406578063964844,
    -12.794132232666016,
    -12.182308197021484,
    -12.669015884399414,
    -13.825421333312988,
    -8.497254371643066,
    -13.710942268371582,
    -10.821403503417969,
    -12.96695327758789,
    -13.50233268737793,
    -14.252979278564453,
    -12.690325736999512,
    -12.644253730773926,
    -11.217681884765625,
    -5.530364990234375,
    -11.728997230529785,
    -14.01970100402832,
    -14.183956146240234,
    -6.582267761230469,
    -9.365259170532227,
    -6.0461626052856445,
    -7.482025623321533,
    -7.319528579711914,
    -13.754130363464355,
    -12.329744338989258,
    -14.684525489807129,
    -7.452380657196045,
    -12.367213249206543,
    -13.013487815856934,
    -10.484649658203125,
    -11.331403732299805,
    -13.430648803710938,
    -11.846324920654297,
    -11.766498565673828,
    -11.94919490814209,
    -13.64667797088623,
    -12.330714225769043,
    -12.643916130065918,
    -12.118013381958008,
    -12.920206069946289,
    -9.852779388427734,
    -13.62667465209961,
    -12.794713020324707,
    -13.23983097076416,
    -9.644025802612305,
    -13.41153335571289,
    -10.862459182739258,
    -13.595255851745605,
    -12.811727523803711,
    -12.114456176757812,
    -12.617325782775879,
    -12.534378051757812,
    -12.435154914855957,
    -11.79420280456543,
    -13.141073226928711,
    -10.228925704956055,
    -12.648173332214355,
    -10.5259370803833,
    -13.075540542602539,
    -12.833207130432129,
    -12.930810928344727,
    -11.625775337219238,
    -8.988334655761719,
    -11.492377281188965,
    -14.40893268585205,
    -12.106353759765625,
    -13.25969409942627,
    -13.190732955932617,
    -14.228679656982422,
    -13.389674186706543,
    -11.702837944030762,
    -12.21057415008545,
    -13.743621826171875,
    -14.52221393585205,
    -13.440570831298828,
    -12.3108491897583,
    -13.243945121765137,
    -13.412277221679688,
    -11.340847969055176,
    -9.651451110839844,
    -11.63448429107666,
    -14.10894775390625,
    -13.651695251464844,
    -13.614228248596191,
    -12.83806037902832,
    -13.661396026611328,
    -9.87491512298584,
    -9.8951416015625,
    -11.809096336364746,
    -10000.0,
    -11.665786743164062,
    -9.869390487670898,
    -13.02005672454834,
    -13.772218704223633,
    -12.269754409790039,
    -10000.0,
    -10.893101692199707,
    -14.356070518493652,
    -13.704068183898926,
    -13.16357707977295,
    -13.131183624267578,
    -11.631052017211914,
    -11.685710906982422,
    -8.907776832580566,
    -9.99026870727539,
    -14.045997619628906,
    -12.187337875366211,
    -13.198140144348145,
    -11.964822769165039,
    -12.250166893005371,
    -14.266410827636719,
    -11.802629470825195,
    -11.381916046142578,
    -11.162945747375488,
    -12.44157886505127,
    -9.786359786987305,
    -10000.0,
    -11.233309745788574,
    -11.009201049804688,
    -12.883721351623535,
    -11.877254486083984,
    -12.20182991027832,
    -14.277528762817383,
    -13.7249755859375,
    -12.742781639099121,
    -12.661029815673828,
    -12.547115325927734,
    -10.75460147857666,
    -12.907571792602539,
    -12.363632202148438,
    -11.848713874816895,
    -14.31727123260498,
    -14.046844482421875,
    -12.718457221984863,
    -13.913930892944336,
    -13.322484016418457,
    -12.36288833618164,
    -11.979717254638672,
    -12.366744041442871,
    -13.646872520446777,
    -13.255087852478027,
    -12.110769271850586,
    -8.450657844543457,
    -12.003588676452637,
    -8.075675010681152,
    -13.522724151611328,
    -13.485895156860352,
    -13.05333423614502,
    -13.399734497070312,
    -11.368695259094238,
    -13.210000038146973,
    -13.97340202331543,
    -11.725092887878418,
    -13.334667205810547,
    -10.739959716796875,
    -13.98511791229248,
    -13.574196815490723,
    -12.201776504516602,
    -12.244017601013184,
    -11.784577369689941,
    -11.283102035522461,
    -6.465692520141602,
    -13.550567626953125,
    -10000.0,
    -11.969606399536133,
    -7.697822093963623,
    -14.338610649108887,
    -13.137377738952637,
    -12.166990280151367,
    -11.836442947387695,
    -13.03665542602539,
    -10000.0,
    -12.438132286071777,
    -11.183541297912598,
    -12.041357040405273,
    -12.614006996154785,
    -11.056611061096191,
    -12.743069648742676,
    -12.888111114501953,
    -11.329586029052734,
    -10.89394760131836,
    -13.152234077453613,
    -12.330127716064453,
    -11.13021469116211,
    -12.93645191192627,
    -11.057968139648438,
    -10000.0,
    -10.721052169799805,
    -13.35482406616211,
    -12.192888259887695,
    -13.680505752563477,
    -11.670418739318848,
    -11.871618270874023,
    -11.242685317993164,
    -9.557723999023438,
    -10000.0,
    -10000.0,
    -11.125853538513184,
    -9.22323226928711,
    -13.24915599822998,
    -11.91252613067627,
    -12.721294403076172,
    -11.174097061157227,
    -7.990510940551758,
    -13.991429328918457,
    -13.859502792358398,
    -11.520356178283691,
    -13.971871376037598,
    -10.134190559387207,
    -13.07124137878418,
    -13.591009140014648,
    -10000.0,
    -12.195642471313477,
    -11.237064361572266,
    -14.172703742980957,
    -12.285969734191895,
    -12.486908912658691,
    -13.344427108764648,
    -14.147533416748047,
    -8.739598274230957,
    -10.91167163848877,
    -9.65263843536377,
    -12.717270851135254,
    -9.05600643157959,
    -9.518941879272461,
    -13.623188972473145,
    -13.740755081176758,
    -12.843908309936523,
    -12.340595245361328,
    -11.486748695373535,
    -12.710258483886719,
    -8.179301261901855,
    -9.062299728393555,
    -6.97949743270874,
    -11.858112335205078,
    -11.286624908447266,
    -11.264288902282715,
    -11.513409614562988,
    -12.92937183380127,
    -13.888775825500488,
    -11.602699279785156,
    -11.45335578918457,
    -8.737150192260742,
    -13.517394065856934,
    -5.306643009185791,
    -10.628350257873535,
    -11.167513847351074,
    -8.796040534973145,
    -10000.0,
    -7.871254920959473,
    -12.365166664123535,
    -10.174576759338379,
    -11.040783882141113,
    -10.433000564575195,
    -13.301560401916504,
    -10.412057876586914,
    -12.430901527404785,
    -10.438301086425781,
    -12.994340896606445,
    -9.674080848693848,
    -6.31805419921875,
    -10000.0,
    -13.583410263061523,
    -12.609077453613281,
    -12.849180221557617,
    -13.826027870178223,
    -12.031959533691406,
    -11.845420837402344,
    -13.824118614196777,
    -14.176135063171387,
    -11.988388061523438,
    -11.812614440917969,
    -11.836989402770996,
    -11.457304000854492,
    -7.770702362060547,
    -7.727717399597168,
    -11.643401145935059,
    -11.470467567443848,
    -7.818939208984375,
    -11.843179702758789,
    -13.107500076293945,
    -3.9299705028533936,
    -8.545232772827148,
    -10.604230880737305,
    -11.725444793701172,
    -14.248205184936523,
    -12.327702522277832,
    -10.582293510437012,
    -13.244439125061035,
    -12.059713363647461,
    -12.921284675598145,
    -12.883295059204102,
    -8.039029121398926,
    -12.784309387207031,
    -9.565606117248535,
    -13.330506324768066,
    -13.591753005981445,
    -11.633308410644531,
    -8.91528034210205,
    -13.258749961853027,
    -14.396084785461426,
    -12.985039710998535,
    -7.417489528656006,
    -13.149593353271484,
    -12.515260696411133,
    -12.587913513183594,
    -8.725703239440918,
    -12.955209732055664,
    -13.303566932678223,
    -12.77481460571289,
    -10.94013786315918,
    -12.95765495300293,
    -12.781828880310059,
    -7.8542914390563965,
    -10.790460586547852,
    -11.324527740478516,
    -10000.0,
    -14.37807559967041,
    -11.92667007446289,
    -13.613455772399902,
    -8.873832702636719,
    -10.859443664550781,
    -10000.0,
    -13.676170349121094,
    -10000.0,
    -10.775018692016602,
    -12.95517349243164,
    -13.232227325439453,
    -14.387094497680664,
    -12.78573989868164,
    -11.10414981842041,
    -12.770772933959961,
    -8.37712574005127,
    -13.284975051879883,
    -12.99605655670166,
    -12.795123100280762,
    -12.59602165222168,
    -14.046062469482422,
    -12.717855453491211,
    -11.992505073547363,
    -11.261098861694336,
    -11.927038192749023,
    -7.993113040924072,
    -12.678472518920898,
    -8.111339569091797,
    -8.321968078613281,
    -9.167539596557617,
    -6.938859939575195,
    -10.086030006408691,
    -11.12663459777832,
    -10.549439430236816,
    -10.726285934448242,
    -9.660466194152832,
    -8.06203842163086,
    -9.214642524719238,
    -13.663848876953125,
    -11.201567649841309,
    -11.692606925964355,
    -10000.0,
    -11.061088562011719,
    -11.801623344421387,
    -12.245379447937012,
    -12.138701438903809,
    -12.882545471191406,
    -12.515228271484375,
    -13.013315200805664,
    -10000.0,
    -12.440690994262695,
    -11.182541847229004,
    -12.293285369873047,
    -13.289390563964844,
    -8.25012493133545,
    -9.714176177978516,
    -8.54870319366455,
    -10.123932838439941,
    -10.123574256896973,
    -10.787864685058594,
    -10.535843849182129,
    -12.084434509277344,
    -11.367830276489258,
    -9.272168159484863,
    -12.730428695678711,
    -10.77696418762207,
    -11.299437522888184,
    -9.2794771194458,
    -10.121893882751465,
    -12.715132713317871,
    -9.817319869995117,
    -11.207874298095703,
    -9.38442325592041,
    -12.960518836975098,
    -9.32898998260498,
    -11.51174259185791,
    -10.884286880493164,
    -11.72599983215332,
    -13.018866539001465,
    -13.688644409179688,
    -11.104406356811523,
    -9.628833770751953,
    -10000.0,
    -14.26093864440918,
    -11.645624160766602,
    -13.037396430969238,
    -13.70888900756836,
    -14.17890739440918,
    -12.572925567626953,
    -11.417001724243164,
    -11.92243480682373,
    -10000.0,
    -10000.0,
    -9.334487915039062,
    -11.304604530334473,
    -8.963071823120117,
    -8.566967010498047,
    -8.42164134979248,
    -7.929381370544434,
    -12.258378028869629,
    -8.675025939941406,
    -7.946563243865967,
    -12.063398361206055,
    -11.749732971191406,
    -10000.0,
    -10000.0,
    -11.486349105834961,
    -8.294340133666992,
    -8.934319496154785,
    -9.14141845703125,
    -8.774731636047363,
    -9.606856346130371,
    -7.985258102416992,
    -8.77881145477295,
    -9.519185066223145,
    -11.011818885803223,
    -10000.0,
    -12.663806915283203,
    -9.498204231262207,
    -11.668294906616211,
    -11.114726066589355,
    -10.064451217651367,
    -12.4163236618042,
    -9.18289566040039,
    -14.760283470153809,
    -12.412688255310059,
    -12.485615730285645,
    -13.954992294311523,
    -10.590344429016113,
    -11.5427827835083,
    -10.981088638305664,
    -7.230983257293701,
    -12.179085731506348,
    -11.862399101257324,
    -8.748784065246582,
    -12.161140441894531,
    -6.327768802642822,
    -10.773768424987793,
    -11.07607364654541,
    -12.150201797485352,
    -11.026751518249512,
    -10.101223945617676,
    -12.312088966369629,
    -13.726814270019531,
    -10.998577117919922,
    -11.658036231994629,
    -12.724591255187988,
    -8.90641975402832,
    -10.587677001953125,
    -13.232854843139648,
    -12.673201560974121,
    -12.671024322509766,
    -9.579854965209961,
    -12.255494117736816,
    -13.195446968078613,
    -13.792229652404785,
    -12.136938095092773,
    -14.033784866333008,
    -11.097009658813477,
    -12.227850914001465,
    -8.381165504455566,
    -11.749275207519531,
    -10.788141250610352,
    -9.176112174987793,
    -8.276718139648438,
    -12.19137954711914,
    -12.501619338989258,
    -10000.0,
    -12.824344635009766,
    -8.281817436218262,
    -11.095662117004395,
    -14.165250778198242,
    -11.348094940185547,
    -12.567456245422363,
    -8.52457332611084,
    -12.733758926391602,
    -14.122416496276855,
    -12.041360855102539,
    -14.223989486694336,
    -10.91444206237793,
    -11.301746368408203,
    -13.864544868469238,
    -9.358236312866211,
    -12.629053115844727,
    -13.954301834106445,
    -12.757906913757324,
    -11.3294677734375,
    -12.579774856567383,
    -9.734641075134277,
    -12.667106628417969,
    -7.761864185333252,
    -13.73751163482666,
    -8.641522407531738,
    -9.142242431640625,
    -11.219501495361328,
    -8.902569770812988,
    -10.32934284210205,
    -9.886985778808594,
    -12.262642860412598,
    -10.265408515930176,
    -10.638322830200195,
    -13.340587615966797,
    -13.356618881225586,
    -11.643696784973145,
    -14.654583930969238,
    -11.425148963928223,
    -9.355377197265625,
    -13.895018577575684,
    -7.402246475219727,
    -14.136250495910645,
    -6.3201680183410645,
    -13.139766693115234,
    -12.429423332214355,
    -6.986958980560303,
    -12.735187530517578,
    -9.379314422607422,
    -13.72009563446045,
    -14.089472770690918,
    -13.748627662658691,
    -11.978914260864258,
    -13.91929817199707,
    -13.818605422973633,
    -12.800165176391602,
    -12.482606887817383,
    -7.0481696128845215,
    -13.999007225036621,
    -12.334272384643555,
    -9.02311897277832,
    -12.519035339355469,
    -12.279437065124512,
    -13.015851020812988,
    -11.549497604370117,
    -10.443224906921387,
    -11.093907356262207,
    -11.322037696838379,
    -12.739632606506348,
    -11.954368591308594,
    -11.006121635437012,
    -6.716159820556641,
    -13.072667121887207,
    -9.844562530517578,
    -7.880402088165283,
    -12.887127876281738,
    -9.566628456115723,
    -12.454107284545898,
    -13.231634140014648,
    -10.958243370056152,
    -7.653661727905273,
    -10.862187385559082,
    -12.770365715026855,
    -13.171697616577148,
    -12.640562057495117,
    -12.947507858276367,
    -12.908676147460938,
    -13.518932342529297,
    -12.32068157196045,
    -13.127158164978027,
    -11.459029197692871,
    -8.377157211303711,
    -10000.0,
    -10.775200843811035,
    -10.465039253234863,
    -12.271913528442383,
    -14.012896537780762,
    -11.834538459777832,
    -11.865020751953125,
    -13.912064552307129,
    -13.423148155212402,
    -12.969127655029297,
    -13.150151252746582,
    -13.349272727966309,
    -13.358369827270508,
    -13.805335998535156,
    -10000.0,
    -9.97810173034668,
    -9.83073902130127,
    -10.826997756958008,
    -10.815749168395996,
    -13.47970962524414,
    -13.573468208312988,
    -7.573562145233154,
    -13.315520286560059,
    -9.457472801208496,
    -10.05649185180664,
    -8.165127754211426,
    -12.03433609008789,
    -11.478641510009766,
    -13.337766647338867,
    -12.477649688720703,
    -12.112797737121582,
    -13.071025848388672,
    -13.196009635925293,
    -13.268590927124023,
    -12.347124099731445,
    -13.836188316345215,
    -12.877021789550781,
    -11.046356201171875,
    -9.727120399475098,
    -11.82292366027832,
    -12.20386028289795,
    -11.933242797851562,
    -13.743108749389648,
    -10000.0,
    -13.26471996307373,
    -7.864959716796875,
    -12.188377380371094,
    -13.456745147705078,
    -13.93160629272461,
    -10000.0,
    -12.802282333374023,
    -9.642523765563965,
    -13.602763175964355,
    -13.777410507202148,
    -14.326563835144043,
    -12.257325172424316,
    -8.880353927612305,
    -11.984357833862305,
    -10.867341995239258,
    -13.713247299194336,
    -10.132527351379395,
    -13.895491600036621,
    -14.169499397277832,
    -11.725127220153809,
    -13.49624252319336,
    -13.843846321105957,
    -13.832304000854492,
    -13.618553161621094,
    -11.058784484863281,
    -10.402983665466309,
    -10.856165885925293
  ]
}

