---
teardown:
  - do:
      raw:
        method: DELETE
        path: "_data_stream/*"
  - do:
      raw:
        method: DELETE
        path: "_index_template/*"
---
"line_24":
  - skip:
      features:
        - default_shards
        - stash_in_key
        - stash_in_path
        - stash_path_replace
        - warnings
# Named setup sec_logs

  - do:
      indices.put_index_template:
        name: my-data-stream-template
        body: |
          {
            "index_patterns": [ "my-data-stream*" ],
            "data_stream": { },
            "priority": 500
          }

  - do:
      raw:
        method: PUT
        path: '_data_stream/my-data-stream'

  - do:
        bulk:
          index: my-data-stream
          refresh: true
          body: |
            {"create":{}}
            {"@timestamp": "2099-12-06T11:04:05.000Z", "event": { "category": "process", "id": "edwCRnyD", "sequence": 1 }, "process": { "pid": 2012, "name": "cmd.exe", "executable": "C:\\Windows\\System32\\cmd.exe" }}
            {"create":{}}
            {"@timestamp": "2099-12-06T11:04:07.000Z", "event": { "category": "file", "id": "dGCHwoeS", "sequence": 2 }, "file": { "accessed": "2099-12-07T11:07:08.000Z", "name": "cmd.exe", "path": "C:\\Windows\\System32\\cmd.exe", "type": "file", "size": 16384 }, "process": { "pid": 2012, "name": "cmd.exe", "executable": "C:\\Windows\\System32\\cmd.exe" }}
            {"create":{}}
            {"@timestamp": "2099-12-07T11:06:07.000Z", "event": { "category": "process", "id": "cMyt5SZ2", "sequence": 3 }, "process": { "pid": 2012, "name": "cmd.exe", "executable": "C:\\Windows\\System32\\cmd.exe" } }
            {"create":{}}
            {"@timestamp": "2099-12-07T11:07:09.000Z", "event": { "category": "process", "id": "aR3NWVOs", "sequence": 4 }, "process": { "pid": 2012, "name": "regsvr32.exe", "command_line": "regsvr32.exe  /s /u /i:https://...RegSvr32.sct scrobj.dll", "executable": "C:\\Windows\\System32\\regsvr32.exe" }}
            {"create":{}}
            {"@timestamp": "2099-12-07T11:07:10.000Z", "event": { "category": "file", "id": "tZ1NWVOs", "sequence": 5 }, "process": { "pid": 2012, "name": "regsvr32.exe", "executable": "C:\\Windows\\System32\\regsvr32.exe" }, "file": { "path": "C:\\Windows\\System32\\scrobj.dll", "name": "scrobj.dll" }}
            {"create":{}}
            {"@timestamp": "2099-12-07T11:07:10.000Z", "event": { "category": "process", "id": "GTSmSqgz0U", "sequence": 6, "type": "termination" }, "process": { "pid": 2012, "name": "regsvr32.exe", "executable": "C:\\Windows\\System32\\regsvr32.exe" }}
  - do:
      raw:
        method: GET
        path: "my-data-stream/_eql/search"
        body: |
          {
            "query": "\n    process where process.name == \"regsvr32.exe\"\n  "
          }
  - is_false: _shards.failures
---
"line_533":
  - skip:
      features:
        - default_shards
        - stash_in_key
        - stash_in_path
        - stash_path_replace
        - warnings
# Named setup sec_logs

  - do:
      indices.put_index_template:
        name: my-data-stream-template
        body: |
          {
            "index_patterns": [ "my-data-stream*" ],
            "data_stream": { },
            "priority": 500
          }

  - do:
      raw:
        method: PUT
        path: '_data_stream/my-data-stream'

  - do:
        bulk:
          index: my-data-stream
          refresh: true
          body: |
            {"create":{}}
            {"@timestamp": "2099-12-06T11:04:05.000Z", "event": { "category": "process", "id": "edwCRnyD", "sequence": 1 }, "process": { "pid": 2012, "name": "cmd.exe", "executable": "C:\\Windows\\System32\\cmd.exe" }}
            {"create":{}}
            {"@timestamp": "2099-12-06T11:04:07.000Z", "event": { "category": "file", "id": "dGCHwoeS", "sequence": 2 }, "file": { "accessed": "2099-12-07T11:07:08.000Z", "name": "cmd.exe", "path": "C:\\Windows\\System32\\cmd.exe", "type": "file", "size": 16384 }, "process": { "pid": 2012, "name": "cmd.exe", "executable": "C:\\Windows\\System32\\cmd.exe" }}
            {"create":{}}
            {"@timestamp": "2099-12-07T11:06:07.000Z", "event": { "category": "process", "id": "cMyt5SZ2", "sequence": 3 }, "process": { "pid": 2012, "name": "cmd.exe", "executable": "C:\\Windows\\System32\\cmd.exe" } }
            {"create":{}}
            {"@timestamp": "2099-12-07T11:07:09.000Z", "event": { "category": "process", "id": "aR3NWVOs", "sequence": 4 }, "process": { "pid": 2012, "name": "regsvr32.exe", "command_line": "regsvr32.exe  /s /u /i:https://...RegSvr32.sct scrobj.dll", "executable": "C:\\Windows\\System32\\regsvr32.exe" }}
            {"create":{}}
            {"@timestamp": "2099-12-07T11:07:10.000Z", "event": { "category": "file", "id": "tZ1NWVOs", "sequence": 5 }, "process": { "pid": 2012, "name": "regsvr32.exe", "executable": "C:\\Windows\\System32\\regsvr32.exe" }, "file": { "path": "C:\\Windows\\System32\\scrobj.dll", "name": "scrobj.dll" }}
            {"create":{}}
            {"@timestamp": "2099-12-07T11:07:10.000Z", "event": { "category": "process", "id": "GTSmSqgz0U", "sequence": 6, "type": "termination" }, "process": { "pid": 2012, "name": "regsvr32.exe", "executable": "C:\\Windows\\System32\\regsvr32.exe" }}
  - do:
      raw:
        method: GET
        path: "my-data-stream/_eql/search"
        body: |
          {
            "query": "\n    process where (process.name == \"cmd.exe\" and process.pid != 2013)\n  "
          }
  - is_false: _shards.failures
  - match:
      $body:
        {
          "is_partial": false,
          "is_running": false,
          "took": $body.took,
          "timed_out": false,
          "hits": {
            "total": {
              "value": 2,
              "relation": "eq"
            },
            "events": [
              {
                "_index": $body.hits.events.0._index,
                "_id": $body.hits.events.0._id,
                "_source": {
                  "@timestamp": "2099-12-06T11:04:05.000Z",
                  "event": {
                    "category": "process",
                    "id": "edwCRnyD",
                    "sequence": 1
                  },
                  "process": {
                    "pid": 2012,
                    "name": "cmd.exe",
                    "executable": "C:\\Windows\\System32\\cmd.exe"
                  }
                }
              },
              {
                "_index": $body.hits.events.0._index,
                "_id": $body.hits.events.1._id,
                "_source": {
                  "@timestamp": "2099-12-07T11:06:07.000Z",
                  "event": {
                    "category": "process",
                    "id": "cMyt5SZ2",
                    "sequence": 3
                  },
                  "process": {
                    "pid": 2012,
                    "name": "cmd.exe",
                    "executable": "C:\\Windows\\System32\\cmd.exe"
                  }
                }
              }
            ]
          }
        }
---
"line_631":
  - skip:
      features:
        - default_shards
        - stash_in_key
        - stash_in_path
        - stash_path_replace
        - warnings
# Named setup sec_logs

  - do:
      indices.put_index_template:
        name: my-data-stream-template
        body: |
          {
            "index_patterns": [ "my-data-stream*" ],
            "data_stream": { },
            "priority": 500
          }

  - do:
      raw:
        method: PUT
        path: '_data_stream/my-data-stream'

  - do:
        bulk:
          index: my-data-stream
          refresh: true
          body: |
            {"create":{}}
            {"@timestamp": "2099-12-06T11:04:05.000Z", "event": { "category": "process", "id": "edwCRnyD", "sequence": 1 }, "process": { "pid": 2012, "name": "cmd.exe", "executable": "C:\\Windows\\System32\\cmd.exe" }}
            {"create":{}}
            {"@timestamp": "2099-12-06T11:04:07.000Z", "event": { "category": "file", "id": "dGCHwoeS", "sequence": 2 }, "file": { "accessed": "2099-12-07T11:07:08.000Z", "name": "cmd.exe", "path": "C:\\Windows\\System32\\cmd.exe", "type": "file", "size": 16384 }, "process": { "pid": 2012, "name": "cmd.exe", "executable": "C:\\Windows\\System32\\cmd.exe" }}
            {"create":{}}
            {"@timestamp": "2099-12-07T11:06:07.000Z", "event": { "category": "process", "id": "cMyt5SZ2", "sequence": 3 }, "process": { "pid": 2012, "name": "cmd.exe", "executable": "C:\\Windows\\System32\\cmd.exe" } }
            {"create":{}}
            {"@timestamp": "2099-12-07T11:07:09.000Z", "event": { "category": "process", "id": "aR3NWVOs", "sequence": 4 }, "process": { "pid": 2012, "name": "regsvr32.exe", "command_line": "regsvr32.exe  /s /u /i:https://...RegSvr32.sct scrobj.dll", "executable": "C:\\Windows\\System32\\regsvr32.exe" }}
            {"create":{}}
            {"@timestamp": "2099-12-07T11:07:10.000Z", "event": { "category": "file", "id": "tZ1NWVOs", "sequence": 5 }, "process": { "pid": 2012, "name": "regsvr32.exe", "executable": "C:\\Windows\\System32\\regsvr32.exe" }, "file": { "path": "C:\\Windows\\System32\\scrobj.dll", "name": "scrobj.dll" }}
            {"create":{}}
            {"@timestamp": "2099-12-07T11:07:10.000Z", "event": { "category": "process", "id": "GTSmSqgz0U", "sequence": 6, "type": "termination" }, "process": { "pid": 2012, "name": "regsvr32.exe", "executable": "C:\\Windows\\System32\\regsvr32.exe" }}
  - do:
      raw:
        method: GET
        path: "my-data-stream/_eql/search"
        body: |
          {
            "query": "\n    sequence by process.pid\n      [ file where file.name == \"cmd.exe\" and process.pid != 2013 ]\n      [ process where stringContains(process.executable, \"regsvr32\") ]\n  "
          }
  - is_false: _shards.failures
  - match:
      $body:
        {
          "is_partial": false,
          "is_running": false,
          "took": $body.took,
          "timed_out": false,
          "hits": {
            "total": {
              "value": 1,
              "relation": "eq"
            },
            "sequences": [
              {
                "join_keys": [
                  2012
                ],
                "events": [
                  {
                    "_index": $body.hits.sequences.0.events.0._index,
                    "_id": $body.hits.sequences.0.events.0._id,
                    "_source": {
                      "@timestamp": "2099-12-06T11:04:07.000Z",
                      "event": {
                        "category": "file",
                        "id": "dGCHwoeS",
                        "sequence": 2
                      },
                      "file": {
                        "accessed": "2099-12-07T11:07:08.000Z",
                        "name": "cmd.exe",
                        "path": "C:\\Windows\\System32\\cmd.exe",
                        "type": "file",
                        "size": 16384
                      },
                      "process": {
                        "pid": 2012,
                        "name": "cmd.exe",
                        "executable": "C:\\Windows\\System32\\cmd.exe"
                      }
                    }
                  },
                  {
                    "_index": $body.hits.sequences.0.events.0._index,
                    "_id": $body.hits.sequences.0.events.1._id,
                    "_source": {
                      "@timestamp": "2099-12-07T11:07:09.000Z",
                      "event": {
                        "category": "process",
                        "id": "aR3NWVOs",
                        "sequence": 4
                      },
                      "process": {
                        "pid": 2012,
                        "name": "regsvr32.exe",
                        "command_line": "regsvr32.exe  /s /u /i:https://...RegSvr32.sct scrobj.dll",
                        "executable": "C:\\Windows\\System32\\regsvr32.exe"
                      }
                    }
                  }
                ]
              }
            ]
          }
        }
